---
kind: type
id: T:Autodesk.Revit.Exceptions.ObjectAccessException
source: html/7d69a00b-f531-c575-0e55-ea2f3858560d.htm
---
# Autodesk.Revit.Exceptions.ObjectAccessException

The exception that is thrown when an operation is denied, e.g. an attempt was made to set a read-only property.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ObjectAccessException : InvalidOperationException
```